# int

# 0으로 시작
# print(0144) # 0으로 시작할 수 없다.

# underscore(_) 사용
print(12_345_678) # _를 사용하여 숫자들을 읽기 쉽도록 그룹으로 묶을 수 있다.
print(1234_5678) # _ 위치는 상관없다
print(1_2_3_4_5_6_7_8) # _ 갯수도 상관없다
# print(_1234_5678) # 맨 앞은 안된다
# print(1234_5678_) # 맨 뒤는 안된다

print(0o_144) # 0o 다음에 어디든 _를 위치시킬 수 있다.
print(0o14_4)
# print(_0o144) # 맨 앞은 안된다.
# print(0o144_) # 맨 뒤는 안된다.

print(0x_3a4b5c6d) # 0x 다음에 어디든 _를 위치시킬 수 있다.
print(0x3a4b_5c6d)
# print(_0x3a4b5c6d) # 맨 앞은 안된다.
# print(0x3a4b_5c6d_) # 맨 뒤는 안된다.

print(0b_01111111) # 0b 다음에 어디든 _를 위치시킬 수 있다.
print(0b0111_1111)
# print(_0b01111111) # 맨 앞은 안된다.
# print(0b01111111_) # 맨 뒤는 안된다.

