// 상속 - 상속하지 않고 기능 추가 I
package com.eomcs.oop.ex05.b;

public class Exam01 {
  public static void main(String[] args) {
    // 새 프로젝트에서는 제조사, 모델명, 수용인원 외에
    // 썬루프 장착여부, 자동변속 여부를 추가적으로 저장하고 싶다!
    //
    // 방법1) 기존의 Car 클래스를 변경한다
    //       문제점:
    //       => 기존 소스를 변경하게 되면 기존의 Car를 사용해서 만든 프로그램들도
    //          영향을 받는다.
    //       => 심각한 오류가 발생할 수 있다.
    //       => 그래서 기존의 소스 코드를 손대는 것은 매우 위험하다.
    //       => 그리고 계속 코드를 덧 붙이다 보면 누더기 코드가 될 가능성이 있다.
    //       => 쓰지도 않는 코드가 계속 누적되는 문제가 있다.
    //
    Car c1 = new Car("비트자동차", "티코", 5, true, true);



  }
}

/*
# 기능 추가하기
1) 기존 클래스에 코드를 추가하는 방법
  - 기존 코드를 변경하게 되면 원래 되던 기능도 오류가 발생할 수 있는 위험이 있다.
  - 그래서 원래 코드를 손대는 것은 매우 위험한 일이다.
  - 기존에 잘 되던 기능까지 동작이 안되는 문제가 발생할 수 있기 때문이다.

2) 기존 코드를 복사하여 새 클래스를 만드는 방법
  - 장점
    - 기존 코드를 손대지 않기 때문에 문제가 발생할 가능성은 줄인다.
  - 단점
    - 기존 코드의 크기가 큰 경우에는 복사 붙여넣기가 어렵다.
    - 기존 클래스의 소스가 없는 경우에는 이 방법이 불가능하다.
      엥? 다른 개발자가 배포한 라이브러리만 있는 경우를 말한다.
      소스가 없는 다른 개발자가 만든 클래스에 기능을 덧 붙일 때는 이 방법이 불가능하다.
    - 기존 코드에 버그가 있을 때 복사 붙여넣기 해서 만든 클래스도 영향을 받는다.
    - 기존 코드를 변경했을 때 복사 붙여넣기 한 모든 클래스를 찾아 변경해야 한다.
3) 기존 코드를 상속 받아 기능을 추가하는 방법
  - 장점
    - 기존 클래스의 소스 코드가 필요 없다.
    - 간단한 선언으로 상속 받겠다고 표시한 후 새 기능만 추가하면 된다.
  - 단점
    - 일부 기능만 상속 받을 수 없다.
    - 쓰든 안쓰든 모든 기능을 상속 받는다.
 */


